# Pandas Documentation on Group By

In this notebook, you will work through the Pandas documentation on "group by".

## Imports

In [1]:
import numpy as np
import pandas as pd

## Pandas group by: split-apply-combine

In this notebook, you are going to learn how to use Pandas by typing the code from the Pandas documentation into this notebook.

* Go to the Pandas Documentation for [Group By](http://pandas.pydata.org/pandas-docs/stable/groupby.html#group-by-split-apply-combine).
* Type all of the code from that section of the documentation into this notebook and get it working.
* **To learn this API well, you must type the code rather than copy and pasting it**.
* Create a new cell in this section for each `In[]` prompt in the documentation.
* Ignore the cells in the **Grading** section below.
* No Markdown comments are needed.
* Skip the following sub-sections:
  - Grouping with a Grouper specification
  - Plotting
  - Examples

## Grading

In [2]:
df = pd.DataFrame({ 'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})

In [3]:
df

     A      B         C         D
0  foo    one  1.306573 -0.525972
1  bar    one  0.812395  1.463295
2  foo    two  1.700128  0.635901
3  bar  three  0.142318  0.318801
4  foo    two  0.575242 -1.299371
5  bar    two -0.079729  1.340244
6  foo    one  1.350487 -0.640374
7  foo  three -2.419653  0.885850

In [4]:
grouped = df.groupby('A')
grouped

In [5]:
grouped = df.groupby(['A', 'B'])
grouped

In [6]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'

In [7]:
grouped = df.groupby(get_letter_type, axis=1)

In [8]:
lst = [1, 2, 3, 1, 2, 3]

In [9]:
s = pd.Series([1, 2, 3, 10, 20, 30], lst)

In [10]:
grouped = s.groupby(level=0)

In [11]:
grouped.first()

1    1
2    2
3    3
dtype: int64

In [12]:
grouped.last()

1    10
2    20
3    30
dtype: int64

In [13]:
grouped.sum()

1    11
2    22
3    33
dtype: int64

In [14]:
# GroupBy sorting
df2 = pd.DataFrame({'X' : ['B', 'B', 'A', 'A'], 'Y' : [1, 2, 3, 4]})

In [15]:
df2.groupby(['X']).sum()

   Y
X
A  7
B  3

In [16]:
df2.groupby(['X'], sort=False).sum()

   Y
X
B  3
A  7

In [17]:
df3 = pd.DataFrame({'X' : ['A', 'B', 'A', 'B'], 'Y' : [1, 4, 3, 2]})

In [18]:
df3.groupby(['X']).get_group('A')

   X  Y
0  A  1
2  A  3

In [19]:
df3.groupby(['X']).get_group('B')

   X  Y
1  B  4
3  B  2

In [20]:
# GroupBy object attributes
df.groupby('A').groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [21]:
df.groupby(get_letter_type, axis=1).groups

{'consonant': ['B', 'C', 'D'], 'vowel': ['A']}

In [22]:
grouped = df.groupby(['A', 'B'])

In [23]:
grouped.groups

{('bar', 'one'): [1],
 ('bar', 'three'): [3],
 ('bar', 'two'): [5],
 ('foo', 'one'): [0, 6],
 ('foo', 'three'): [7],
 ('foo', 'two'): [2, 4]}

In [24]:
len(grouped)

6

In [25]:
df

     A      B         C         D
0  foo    one  1.306573 -0.525972
1  bar    one  0.812395  1.463295
2  foo    two  1.700128  0.635901
3  bar  three  0.142318  0.318801
4  foo    two  0.575242 -1.299371
5  bar    two -0.079729  1.340244
6  foo    one  1.350487 -0.640374
7  foo  three -2.419653  0.885850

In [26]:
gb = df.groupby('A')

In [27]:
gb.agg

In [28]:
# GroupBy with MultiIndex
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [29]:
index = pd.MultiIndex.from_arrays(arrays, names=['first', 'second'])

In [30]:
s = pd.Series(np.random.randn(8), index=index)

In [31]:
s

first  second
bar    one      -0.790300
       two       0.390104
baz    one      -1.318493
       two      -0.020229
foo    one       0.535261
       two      -0.640632
qux    one       0.806773
       two      -0.217202
dtype: float64

In [32]:
grouped = s.groupby(level=0)

In [33]:
grouped.sum()

first
bar   -0.400196
baz   -1.338721
foo   -0.105371
qux    0.589570
dtype: float64

In [34]:
s.groupby(level='second').sum()

second
one   -0.766759
two   -0.487959
dtype: float64

In [35]:
s.sum(level='second')

second
one   -0.766759
two   -0.487959
dtype: float64

In [36]:
s

first  second
bar    one      -0.790300
       two       0.390104
baz    one      -1.318493
       two      -0.020229
foo    one       0.535261
       two      -0.640632
qux    one       0.806773
       two      -0.217202
dtype: float64

In [37]:
s.groupby(level=['first', 'second']).sum()

first  second
bar    one      -0.790300
       two       0.390104
baz    one      -1.318493
       two      -0.020229
foo    one       0.535261
       two      -0.640632
qux    one       0.806773
       two      -0.217202
dtype: float64

In [38]:
# DataFrame column selection in GroupBy
grouped = df.groupby(['A'])

In [39]:
grouped_C = grouped['C']

In [40]:
grouped_D = grouped['D']

In [41]:
df['C'].groupby(df['A'])

In [42]:
# Iterating through groups
grouped = df.groupby('A')

In [43]:
for name, group in grouped:
    print(name)
    print(group)

bar
     A      B         C         D
1  bar    one  0.812395  1.463295
3  bar  three  0.142318  0.318801
5  bar    two -0.079729  1.340244
foo
     A      B         C         D
0  foo    one  1.306573 -0.525972
2  foo    two  1.700128  0.635901
4  foo    two  0.575242 -1.299371
6  foo    one  1.350487 -0.640374
7  foo  three -2.419653  0.885850

In [44]:
for name, group in df.groupby(['A', 'B']):
    print(name)
    print(group)

('bar', 'one')
     A    B         C         D
1  bar  one  0.812395  1.463295
('bar', 'three')
     A      B         C         D
3  bar  three  0.142318  0.318801
('bar', 'two')
     A    B         C         D
5  bar  two -0.079729  1.340244
('foo', 'one')
     A    B         C         D
0  foo  one  1.306573 -0.525972
6  foo  one  1.350487 -0.640374
('foo', 'three')
     A      B         C        D
7  foo  three -2.419653  0.88585
('foo', 'two')
     A    B         C         D
2  foo  two  1.700128  0.635901
4  foo  two  0.575242 -1.299371

In [45]:
# Selecting a group
grouped.get_group('bar')

     A      B         C         D
1  bar    one  0.812395  1.463295
3  bar  three  0.142318  0.318801
5  bar    two -0.079729  1.340244

In [46]:
df.groupby(['A', 'B']).get_group(('bar', 'one'))

     A    B         C         D
1  bar  one  0.812395  1.463295

In [47]:
# Aggregation
grouped = df.groupby('A')

In [48]:
grouped.aggregate(np.sum)

            C         D
A
bar  0.874985  3.122340
foo  2.512777 -0.943967

In [49]:
grouped = df.groupby(['A', 'B'])

In [50]:
grouped.aggregate(np.sum)

                  C         D
A   B
bar one    0.812395  1.463295
    three  0.142318  0.318801
    two   -0.079729  1.340244
foo one    2.657060 -1.166347
    three -2.419653  0.885850
    two    2.275370 -0.663471

In [51]:
grouped = df.groupby(['A', 'B'], as_index=False)

In [52]:
grouped.aggregate(np.sum)

     A      B         C         D
0  bar    one  0.812395  1.463295
1  bar  three  0.142318  0.318801
2  bar    two -0.079729  1.340244
3  foo    one  2.657060 -1.166347
4  foo  three -2.419653  0.885850
5  foo    two  2.275370 -0.663471

In [53]:
df.groupby('A', as_index=False).sum()

     A         C         D
0  bar  0.874985  3.122340
1  foo  2.512777 -0.943967

In [54]:
df.groupby(['A', 'B']).sum().reset_index()

     A      B         C         D
0  bar    one  0.812395  1.463295
1  bar  three  0.142318  0.318801
2  bar    two -0.079729  1.340244
3  foo    one  2.657060 -1.166347
4  foo  three -2.419653  0.885850
5  foo    two  2.275370 -0.663471

In [55]:
grouped.size()

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

In [56]:
grouped.describe()

                C         D
0 count  1.000000  1.000000
  mean   0.812395  1.463295
  std         NaN       NaN
  min    0.812395  1.463295
  25%    0.812395  1.463295
  50%    0.812395  1.463295
  75%    0.812395  1.463295
  max    0.812395  1.463295
1 count  1.000000  1.000000
  mean   0.142318  0.318801
  std         NaN       NaN
  min    0.142318  0.318801
  25%    0.142318  0.318801
  50%    0.142318  0.318801
  75%    0.142318  0.318801
  max    0.142318  0.318801
2 count  1.000000  1.000000
  mean  -0.079729  1.340244
  std         NaN       NaN
  min   -0.079729  1.340244
  25%   -0.079729  1.340244
  50%   -0.079729  1.340244
  75%   -0.079729  1.340244
  max   -0.079729  1.340244
3 count  2.000000  2.000000
  mean   1.328530 -0.583173
  std    0.031052  0.080894
  min    1.306573 -0.640374
  25%    1.317551 -0.611774
  50%    1.328530 -0.583173
  75%    1.339508 -0.554573
  max    1.350487 -0.525972
4 count  1.000000  1.000000
  mean  -2.419653  0.885850
  std         NaN       NaN
  min   -2.419653  0.885850
  25%   -2.419653  0.885850
  50%   -2.419653  0.885850
  75%   -2.419653  0.885850
  max   -2.419653  0.885850
5 count  2.000000  2.000000
  mean   1.137685 -0.331735
  std    0.795415  1.368444
  min    0.575242 -1.299371
  25%    0.856463 -0.815553
  50%    1.137685 -0.331735
  75%    1.418906  0.152083
  max    1.700128  0.635901

In [57]:
# Applying multiple functions at once
grouped = df.groupby('A')

In [58]:
grouped['C'].agg([np.sum, np.mean, np.std])

          sum      mean       std
A
bar  0.874985  0.291662  0.464434
foo  2.512777  0.502555  1.684057

In [59]:
grouped['D'].agg({'result1' : np.sum,
                  'result2' : np.mean})

      result1   result2
A
bar  3.122340  1.040780
foo -0.943967 -0.188793

In [60]:
grouped.agg([np.sum, np.mean, np.std])

            C                             D
          sum      mean       std       sum      mean       std
A
bar  0.874985  0.291662  0.464434  3.122340  1.040780  0.628272
foo  2.512777  0.502555  1.684057 -0.943967 -0.188793  0.920051

In [61]:
# Applying different functions to DataFrame columns
grouped.agg({'C' : np.sum,
             'D' : lambda x: np.std(x, ddof=1)})

            D         C
A
bar  0.628272  0.874985
foo  0.920051  2.512777

In [62]:
grouped.agg({'C' : 'sum', 'D' : 'std'})

            D         C
A
bar  0.628272  0.874985
foo  0.920051  2.512777

In [63]:
# Cython-optimized aggregation functions
df.groupby('A').sum()

            C         D
A
bar  0.874985  3.122340
foo  2.512777 -0.943967

In [64]:
df.groupby(['A', 'B']).mean()

                  C         D
A   B
bar one    0.812395  1.463295
    three  0.142318  0.318801
    two   -0.079729  1.340244
foo one    1.328530 -0.583173
    three -2.419653  0.885850
    two    1.137685 -0.331735

In [65]:
# Transformation
index = pd.date_range('10/1/1999', periods=1100)

In [66]:
ts = pd.Series(np.random.normal(0.5, 2, 1100), index)

In [67]:
ts = pd.rolling_mean(ts, 100, 100).dropna()

In [68]:
ts.head()

2000-01-08    0.441679
2000-01-09    0.397306
2000-01-10    0.350209
2000-01-11    0.310261
2000-01-12    0.299112
Freq: D, dtype: float64

In [69]:
ts.tail()

2002-09-30    0.331334
2002-10-01    0.316627
2002-10-02    0.317706
2002-10-03    0.269203
2002-10-04    0.280842
Freq: D, dtype: float64

In [70]:
key = lambda x: x.year

In [71]:
zscore = lambda x: (x - x.mean()) / x.std()

In [72]:
transformed = ts.groupby(key).transform(zscore)

In [73]:
# Original Data
grouped = ts.groupby(key)

In [74]:
grouped.mean()

2000    0.499106
2001    0.440034
2002    0.548603
dtype: float64

In [75]:
grouped.std()

2000    0.162215
2001    0.150795
2002    0.111255
dtype: float64

In [76]:
# Transformed Data
grouped_trans = transformed.groupby(key)

In [77]:
grouped_trans.mean()

2000    1.781305e-16
2001   -2.220446e-16
2002    4.328667e-17
dtype: float64

In [78]:
grouped_trans.std()

2000    1
2001    1
2002    1
dtype: float64

In [79]:
compare = pd.DataFrame({'Original': ts, 'Transformed': transformed})

In [80]:
# compare.plot()

In [81]:
data_df = df
df

     A      B         C         D
0  foo    one  1.306573 -0.525972
1  bar    one  0.812395  1.463295
2  foo    two  1.700128  0.635901
3  bar  three  0.142318  0.318801
4  foo    two  0.575242 -1.299371
5  bar    two -0.079729  1.340244
6  foo    one  1.350487 -0.640374
7  foo  three -2.419653  0.885850

In [82]:
countries = np.array(['US', 'UK', 'GR', 'JP'])

In [83]:
key = countries[np.random.randint(0, 4, 1000)]

In [84]:
# grouped = data_df.groupby(key)

In [85]:
f = lambda x: x.fillna(x.mean())

In [86]:
transformed = grouped.transform(f)

In [87]:
# grouped_trans = transformed.groupby(key)

In [88]:
grouped.mean()

2000    0.499106
2001    0.440034
2002    0.548603
dtype: float64

In [89]:
grouped_trans.mean()

2000    1.781305e-16
2001   -2.220446e-16
2002    4.328667e-17
dtype: float64

In [90]:
grouped.count()

2000    359
2001    365
2002    277
dtype: int64

In [91]:
grouped_trans.count()

2000    359
2001    365
2002    277
dtype: int64

In [92]:
grouped_trans.size()

2000    359
2001    365
2002    277
dtype: int64

In [93]:
grouped.ffill()

2000-01-08    0.441679
2000-01-09    0.397306
2000-01-10    0.350209
2000-01-11    0.310261
2000-01-12    0.299112
2000-01-13    0.311789
2000-01-14    0.265642
2000-01-15    0.253211
2000-01-16    0.283517
2000-01-17    0.272254
2000-01-18    0.275007
2000-01-19    0.278514
2000-01-20    0.272472
2000-01-21    0.276267
2000-01-22    0.324852
2000-01-23    0.262171
2000-01-24    0.221766
2000-01-25    0.221257
2000-01-26    0.204890
2000-01-27    0.228440
2000-01-28    0.214797
2000-01-29    0.189190
2000-01-30    0.128270
2000-01-31    0.113218
2000-02-01    0.128578
2000-02-02    0.132973
2000-02-03    0.148502
2000-02-04    0.171584
2000-02-05    0.140403
2000-02-06    0.170892
                ...
2002-09-05    0.557644
2002-09-06    0.524852
2002-09-07    0.510106
2002-09-08    0.505760
2002-09-09    0.475242
2002-09-10    0.466423
2002-09-11    0.495142
2002-09-12    0.497072
2002-09-13    0.430978
2002-09-14    0.449279
2002-09-15    0.469184
2002-09-16    0.482707
2002-09-17    0.486665
2002-09-18    0.515417
2002-09-19    0.448349
2002-09-20    0.470013
2002-09-21    0.500914
2002-09-22    0.528220
2002-09-23    0.496956
2002-09-24    0.463848
2002-09-25    0.467524
2002-09-26    0.444092
2002-09-27    0.375936
2002-09-28    0.369182
2002-09-29    0.348800
2002-09-30    0.331334
2002-10-01    0.316627
2002-10-02    0.317706
2002-10-03    0.269203
2002-10-04    0.280842
Freq: D, dtype: float64

In [94]:
# Filtration
sf = pd.Series([1, 1, 2, 3, 3, 3])

In [95]:
sf.groupby(sf).filter(lambda x: x.sum() > 2)

3    3
4    3
5    3
dtype: int64

In [96]:
dff = pd.DataFrame({'A': np.arange(8), 'B': list('aabbbbcc')})

In [97]:
dff.groupby('B').filter(lambda x: len(x) > 2)

   A  B
2  2  b
3  3  b
4  4  b
5  5  b

In [98]:
dff.groupby('B').filter(lambda x: len(x) > 2, dropna=False)

    A    B
0 NaN  NaN
1 NaN  NaN
2   2    b
3   3    b
4   4    b
5   5    b
6 NaN  NaN
7 NaN  NaN

In [99]:
dff['C'] = np.arange(8)

In [100]:
dff.groupby('B').filter(lambda x: len(x['C']) > 2)

   A  B  C
2  2  b  2
3  3  b  3
4  4  b  4
5  5  b  5

In [101]:
dff.groupby('B').head(2)

   A  B  C
0  0  a  0
1  1  a  1
2  2  b  2
3  3  b  3
6  6  c  6
7  7  c  7

In [102]:
# Dispatching to instance methods
grouped = df.groupby('A')

In [103]:
grouped.agg(lambda x: x.std())

            C         D
A
bar  0.464434  0.628272
foo  1.684057  0.920051

In [104]:
grouped.std()

            C         D
A
bar  0.464434  0.628272
foo  1.684057  0.920051

In [105]:
tsdf = pd.DataFrame(np.random.randn(1000, 3),
                    index=pd.date_range('1/1/2000', periods=1000),
                    columns=['A', 'B', 'C'])

In [106]:
tsdf.ix[::2] = np.nan

In [107]:
grouped = tsdf.groupby(lambda x: x.year)

In [108]:
grouped.fillna(method='pad')

                   A         B         C
2000-01-01       NaN       NaN       NaN
2000-01-02 -1.393095 -0.469987 -0.579183
2000-01-03 -1.393095 -0.469987 -0.579183
2000-01-04  0.952271 -0.427674  0.796857
2000-01-05  0.952271 -0.427674  0.796857
2000-01-06 -0.127501 -1.013875  0.265897
2000-01-07 -0.127501 -1.013875  0.265897
2000-01-08 -1.211684  0.259838  0.441131
2000-01-09 -1.211684  0.259838  0.441131
2000-01-10 -0.556444 -1.341958  1.204392
2000-01-11 -0.556444 -1.341958  1.204392
2000-01-12 -0.717828 -1.109528 -1.348833
2000-01-13 -0.717828 -1.109528 -1.348833
2000-01-14  1.819111  0.479898  0.198035
2000-01-15  1.819111  0.479898  0.198035
2000-01-16 -0.178370 -1.360439  0.922527
2000-01-17 -0.178370 -1.360439  0.922527
2000-01-18  0.319727  0.678171 -0.419607
2000-01-19  0.319727  0.678171 -0.419607
2000-01-20 -0.631745 -0.129087  2.139401
2000-01-21 -0.631745 -0.129087  2.139401
2000-01-22 -0.239907  0.554078  1.398068
2000-01-23 -0.239907  0.554078  1.398068
2000-01-24  0.665167  0.580899  0.753923
2000-01-25  0.665167  0.580899  0.753923
2000-01-26 -0.213686 -0.484819 -0.218844
2000-01-27 -0.213686 -0.484819 -0.218844
2000-01-28 -0.799876  0.319771  1.729131
2000-01-29 -0.799876  0.319771  1.729131
2000-01-30 -1.285203  1.163881 -0.443054
...              ...       ...       ...
2002-08-28 -0.541729 -1.540845 -1.064863
2002-08-29  1.540913 -0.492183 -0.119232
2002-08-30  1.540913 -0.492183 -0.119232
2002-08-31  0.466246 -0.635063  1.020131
2002-09-01  0.466246 -0.635063  1.020131
2002-09-02  0.002719 -0.967925 -0.909078
2002-09-03  0.002719 -0.967925 -0.909078
2002-09-04 -0.432235  2.078645  2.062085
2002-09-05 -0.432235  2.078645  2.062085
2002-09-06 -0.975952  0.504905  0.626632
2002-09-07 -0.975952  0.504905  0.626632
2002-09-08 -0.029568  1.186743  0.932151
2002-09-09 -0.029568  1.186743  0.932151
2002-09-10 -0.551145  1.377089  0.180317
2002-09-11 -0.551145  1.377089  0.180317
2002-09-12  0.374343  0.612481  0.162094
2002-09-13  0.374343  0.612481  0.162094
2002-09-14 -0.912447 -0.674239  0.589077
2002-09-15 -0.912447 -0.674239  0.589077
2002-09-16  0.853922  0.674685 -0.401080
2002-09-17  0.853922  0.674685 -0.401080
2002-09-18 -0.108924 -0.160414 -0.060655
2002-09-19 -0.108924 -0.160414 -0.060655
2002-09-20  0.462450 -0.531880 -1.048030
2002-09-21  0.462450 -0.531880 -1.048030
2002-09-22 -0.115918 -0.602021  1.257164
2002-09-23 -0.115918 -0.602021  1.257164
2002-09-24  1.492564 -1.000951  0.560737
2002-09-25  1.492564 -1.000951  0.560737
2002-09-26  0.680627  1.175979  1.144581

[1000 rows x 3 columns]

In [109]:
s = pd.Series([9, 8, 7, 5, 19, 1, 4.2, 3.3])

In [110]:
g = pd.Series(list('abababab'))

In [111]:
gb = s.groupby(g)

In [112]:
gb.nlargest(3)

a  4    19.0
   0     9.0
   2     7.0
b  1     8.0
   3     5.0
   7     3.3
dtype: float64

In [113]:
gb.nsmallest(3)

a  6    4.2
   2    7.0
   0    9.0
b  5    1.0
   7    3.3
   3    5.0
dtype: float64

In [114]:
# Flexible apply
df

     A      B         C         D
0  foo    one  1.306573 -0.525972
1  bar    one  0.812395  1.463295
2  foo    two  1.700128  0.635901
3  bar  three  0.142318  0.318801
4  foo    two  0.575242 -1.299371
5  bar    two -0.079729  1.340244
6  foo    one  1.350487 -0.640374
7  foo  three -2.419653  0.885850

In [115]:
grouped = df.groupby('A')

In [116]:
grouped['C'].apply(lambda x: x.describe())

A
bar  count    3.000000
     mean     0.291662
     std      0.464434
     min     -0.079729
     25%      0.031295
     50%      0.142318
     75%      0.477357
     max      0.812395
foo  count    5.000000
     mean     0.502555
     std      1.684057
     min     -2.419653
     25%      0.575242
     50%      1.306573
     75%      1.350487
     max      1.700128
dtype: float64

In [117]:
grouped = df.groupby('A')['C']

In [118]:
def f(group):
    return pd.DataFrame({'original' : group,
                         'demeaned' : group - group.mean()})

In [119]:
grouped.apply(f)

   demeaned  original
0  0.804017  1.306573
1  0.520734  0.812395
2  1.197573  1.700128
3 -0.149343  0.142318
4  0.072686  0.575242
5 -0.371390 -0.079729
6  0.847932  1.350487
7 -2.922208 -2.419653

In [120]:
def f(x):
    return pd.Series([ x, x**2 ], index = ['x', 'x^s'])

In [121]:
s

0     9.0
1     8.0
2     7.0
3     5.0
4    19.0
5     1.0
6     4.2
7     3.3
dtype: float64

In [122]:
s.apply(f)

      x     x^s
0   9.0   81.00
1   8.0   64.00
2   7.0   49.00
3   5.0   25.00
4  19.0  361.00
5   1.0    1.00
6   4.2   17.64
7   3.3   10.89

In [123]:
d = pd.DataFrame({"a":["x", "y"], "b":[1,2]})

In [124]:
def identity(df):
    print(df)
    return df

In [125]:
d.groupby("a").apply(identity)

   a  b
0  x  1
   a  b
0  x  1
   a  b
1  y  2

   a  b
0  x  1
1  y  2

In [126]:
# Other useful features
# Automatic exclusion of nuisance columns
df

     A      B         C         D
0  foo    one  1.306573 -0.525972
1  bar    one  0.812395  1.463295
2  foo    two  1.700128  0.635901
3  bar  three  0.142318  0.318801
4  foo    two  0.575242 -1.299371
5  bar    two -0.079729  1.340244
6  foo    one  1.350487 -0.640374
7  foo  three -2.419653  0.885850

In [127]:
# df.groupby('A').std().df.groupby('A').std()

In [128]:
# Grouping with ordered factors
data = pd.Series(np.random.randn(100))

In [129]:
factor = pd.qcut(data, [0, .25, .5, .75, 1.])

In [130]:
data.groupby(factor).mean()

[-2.82, -0.982]    -1.483180
(-0.982, 0.0893]   -0.424924
(0.0893, 0.803]     0.334143
(0.803, 2.564]      1.444963
dtype: float64

In [131]:
# Taking the first rows of each group
df = pd.DataFrame([[1, 2], [1, 4], [5, 6]], columns=['A', 'B'])

In [132]:
df

   A  B
0  1  2
1  1  4
2  5  6

In [133]:
g = df.groupby('A')

In [134]:
g.head(1)

   A  B
0  1  2
2  5  6

In [135]:
g.tail(1)

   A  B
1  1  4
2  5  6

In [136]:
# Taking the nth row of each group
df = pd.DataFrame([[1, np.nan], [1, 4], [5, 6]], columns=['A', 'B'])

In [137]:
g = df.groupby('A')

In [138]:
g.nth(0)

    B
A
1 NaN
5   6

In [139]:
g.nth(-1)

   B
A
1  4
5  6

In [140]:
g.nth(1)

   B
A
1  4

In [141]:
# nth(0) is the same as g.first()
g.nth(0, dropna='any')

   B
A
1  4
5  6

In [142]:
g.first()

   B
A
1  4
5  6

In [143]:
# nth(-1) is the same as g.last()
g.nth(-1, dropna='any')  # NaNs denote group exhausted when using dropna

   B
A
1  4
5  6

In [144]:
g.last()

   B
A
1  4
5  6

In [145]:
g.B.nth(0, dropna=True)

A
1    4
5    6
Name: B, dtype: float64

In [146]:
df = pd.DataFrame([[1, np.nan], [1, 4], [5, 6]], columns=['A', 'B'])

In [147]:
g = df.groupby('A',as_index=False)

In [148]:
g.nth(0)

   A   B
0  1 NaN
2  5   6

In [149]:
g.nth(-1)

   A  B
1  1  4
2  5  6

In [150]:
business_dates = pd.date_range(start='4/1/2014', end='6/30/2014', freq='B')

In [151]:
df = pd.DataFrame(1, index=business_dates, columns=['a', 'b'])

In [152]:
df.groupby((df.index.year, df.index.month)).nth([0, 3, -1])

            a  b
2014-04-01  1  1
2014-04-04  1  1
2014-04-30  1  1
2014-05-01  1  1
2014-05-06  1  1
2014-05-30  1  1
2014-06-02  1  1
2014-06-05  1  1
2014-06-30  1  1

In [153]:
# Enumerate group items
df = pd.DataFrame(list('aaabba'), columns=['A'])

In [154]:
df

   A
0  a
1  a
2  a
3  b
4  b
5  a

In [155]:
df.groupby('A').cumcount()

0    0
1    1
2    2
3    0
4    1
5    3
dtype: int64

In [156]:
df.groupby('A').cumcount(ascending=False)

0    3
1    2
2    1
3    1
4    0
5    0
dtype: int64